Revit 2027 API
ExportLayerInfo.SetLayerModifiers Method
 Sets a project layer modifier array to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayerModifiers(
	IList<LayerModifier> layermodifiers
)
Public Sub SetLayerModifiers (
	layermodifiers As IList(Of LayerModifier)
)
public:
void SetLayerModifiers(
	IList<LayerModifier^>^ layermodifiers
)
member SetLayerModifiers :
        layermodifiers : IList<LayerModifier> -> unit
Parameters
layermodifiers IList<LayerModifier>
 The project layer modifier array.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace